content/posts/Expanding_the_Active_Inference_Landscape_More_Intrinsic_Motivations_in_the_Perception-Action_Loop_by_Martin_Biehl,_Daniel_Polani,_et_al_in_2018.md
+++
title = "Expanding the Active Inference Landscape More Intrinsic Motivations in the Perception-Action Loop by Martin Biehl, Daniel Polani, et al in 2018"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:24-04:00
slug = "Expanding_the_Active_Inference_Landscape_More_Intrinsic_Motivations_in_the_Perception-Action_Loop_by_Martin_Biehl,_Daniel_Polani,_et_al_in_2018"
draft = false
+++

## [free energy principle]({{< relref "free_energy_principle" >}}), [reinforcement learning]({{< relref "reinforcement_learning" >}}), [papers]({{< relref "papers" >}}) {#free-energy-principle--free-energy-principle-dot-md--reinforcement-learning--reinforcement-learning-dot-md--papers--papers-dot-md}


## Martin Biehl 1, Christian Guckelsberger2 , Christoph Salge3,4 , Simón C. Smith4,5 and Daniel Polani 4 {#martin-biehl-1-christian-guckelsberger2-christoph-salge3-4-simón-c-dot-smith4-5-and-daniel-polani-4}


## related lectures {#related-lectures}


### [Notions of intrinsic motivation by Martin Biehl in 2017]({{< relref "Notions_of_intrinsic_motivation_by_Martin_Biehl_in_2017" >}}) {#notions-of-intrinsic-motivation-by-martin-biehl-in-2017--notions-of-intrinsic-motivation-by-martin-biehl-in-2017-dot-md}


### \_\_Agents within (not as) stochastic processes by Martin Biehl\_\_ — via [(1) 1/28 Agents within (not as) stochastic processes by Martin Biehl \* YouTube](<https://www.youtube.com/watch?v=iLWgD%5FLbxjE&t=83s>) {#agents-within--not-as--stochastic-processes-by-martin-biehl-via--1--1-28-agents-within--not-as--stochastic-processes-by-martin-biehl-youtube--https-www-dot-youtube-dot-com-watch-v-ilwgd-lbxje-and-t-83s}


## 1. Introduction {#1-dot-introduction}


### Computational approaches to intrinsic motivations (Oudeyer and Kaplan, 2009; Schmidhuber, 2010; Santucci et al., 2013) can be categorized roughly by the psychological motivations they are imitating, e.g., drives to manipulate and explore, the reduction of cognitive dissonance, the achievement of optimal incongruity, and finally motivations for effectance, personal causation, competence and self-determination. {#computational-approaches-to-intrinsic-motivations--oudeyer-and-kaplan-2009-schmidhuber-2010-santucci-et-al-dot-2013--can-be-categorized-roughly-by-the-psychological-motivations-they-are-imitating-e-dot-g-dot-drives-to-manipulate-and-explore-the-reduction-of-cognitive-dissonance-the-achievement-of-optimal-incongruity-and-finally-motivations-for-effectance-personal-causation-competence-and-self-determination-dot}

<!--list-separator-->

-  Oudeyer, P.-Y., and Kaplan, F. (2009). What is intrinsic motivation? A typology of computational approaches. Front. Neurorobot. 1:6. doi: 10.3389/neuro.12.006.2007

<!--list-separator-->

-  Schmidhuber, J. (2010). Formal theory of creativity, fun, and intrinsic motivation (1990-2010). IEEE Trans. Auton. Mental Dev. 2, 230–247. doi: 10.1109/TAMD.2010.20 56368

<!--list-separator-->

-  Santucci, V. G., Baldassarre, G., and Mirolli, M. (2013). Which is the best intrinsic motivation signal for learning multiple skills? Front. Neurorobot. 7:22. doi: 10.3389/fnbot.2013.00022


## 2. Related work {#2-dot-related-work}


## 3. Structure of this article {#3-dot-structure-of-this-article}


## 4. Notation {#4-dot-notation}


## 5. Perception-action loop {#5-dot-perception-action-loop}


### 5.1 PA-loop Bayesian network {#5-dot-1-pa-loop-bayesian-network}


### 5.2 Assumptions {#5-dot-2-assumptions}


## 6. Inference and complete posteriors {#6-dot-inference-and-complete-posteriors}


### 6.1 Generative model {#6-dot-1-generative-model}


### 6.2 Bayesian complete posteriors {#6-dot-2-bayesian-complete-posteriors}


### 6.3 Connection to universal reinforcement learning {#6-dot-3-connection-to-universal-reinforcement-learning}


### 6.4 Approximate complete posteriors {#6-dot-4-approximate-complete-posteriors}


## 7. Action selection based on intrinsic motivations {#7-dot-action-selection-based-on-intrinsic-motivations}


### 7.1 Intrinsic motivation and action-value functions {#7-dot-1-intrinsic-motivation-and-action-value-functions}


### 7.2 Deterministic and stochastic action selection {#7-dot-2-deterministic-and-stochastic-action-selection}


### 7.3 Intrinsic motivations {#7-dot-3-intrinsic-motivations}

<!--list-separator-->

-  7.3.1 [free energy principle]({{< relref "free_energy_principle" >}})

<!--list-separator-->

-  7.3.2 [free energy principle]({{< relref "free_energy_principle" >}}) specialized to Friston et al 2015

<!--list-separator-->

-  7.3.3 Empowerment maximization

<!--list-separator-->

-  7.3.4 Predictive information maximization

<!--list-separator-->

-  7.3.5 Knowledge seeking


## 8. Active inference {#8-dot-active-inference}


## 9. Applications and limitations {#9-dot-applications-and-limitations}


## 10. Conclusion {#10-dot-conclusion}


## Appendix {#appendix}


### A. Posterior factor {#a-dot-posterior-factor}


### B. Approximate posterior predictive distribution {#b-dot-approximate-posterior-predictive-distribution}


### C. Notation translation tables {#c-dot-notation-translation-tables}


###  {#}
